# Ai반 2기 python 중급반 - 7주차 정규수업(16:30~18:30) mission
'''
[수업을 시작하기 전에!]
1. 웨일ON으로 원격 회의실 접속하기
2. NAS 서버 접속(접속이 안될 경우 말해주기~)
3. 탐색기를 활용하여 내가 현재 작업하고 있는 파일 경로 열어두기
4. Pycharm 수업 코드 다운로드 받아 열어두기~
5. 수업시간 집중~~~!! 딴 짓! 멈춰~~~~~!

[저번주 복습]
1. class: 상속
2. class: super()와 클래스 변수
'''

# [예외처리]
# : 프로그램 실행 중에 발생하는 예외를 미연에 방지하는 것.

## 예외처리가 필요한 이유 예시:  계산기 프로그램


## 예외처리 연습문제: 환율 계산 문제


## 에러 발생시키기 연습문제


## 예외처리 Mission: 영어단어 공부하기 문제를 'while문 + 예외 처리'로 풀어보자


# [파일 입출력]
## 파일 입출력 연습문제1: 파일 쓰기(w: 새로쓰기 혹은 덮어쓰기)


## 파일 입출력 연습문제2: 파일 추가하기(a: 추가하기)


## 파일 입출력 연습문제3: 파일 읽기(r: 읽기)
## way1) readline 함수 사용(한 줄 씩 읽어오기)


## way2) readlines 함수 사용(모든 줄을 읽어와, 각 줄을 리스트의 요소로 반환)


## way3) read 함수 사용(문서 전체를 하나의 문자열로 가져오기)


